src/toir_cf/src/DataProcessors/торо_РабочееМестоУтвержденияЗаказовНаВнутреннееПотребление/торо_РабочееМестоУтвержденияЗаказовНаВнутреннееПотребление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>торо_РабочееМестоУтвержденияЗаказовНаВнутреннееПотребление</name>
</mdclass:DataProcessor>

src/toir_cf/src/InformationRegisters/торо_ОбщиеДанныеПоРемонтам/торо_ОбщиеДанныеПоРемонтам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ОбщиеДанныеПоРемонтам</name>
  <resources>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </resources>
  <resources>
    <name>ЕстьЗаявка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЕстьНаряд</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЕстьАкт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЕстьАктПриемки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Завершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Замещен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ВидДокументаНачалаЦепочки</name>
    <type>
      <types>EnumRef.торо_ВидыДокументовНачалаЦепочкиРемонтов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </attributes>
  <dimensions>
    <name>IDРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодразделениеИнициатор</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументНачалаЦепочки</name>
    <type>
      <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
      <types>DocumentRef.торо_ПланГрафикРемонта</types>
      <types>DocumentRef.торо_ГрафикРегламентныхМероприятийТОиР</types>
      <types>DocumentRef.торо_ВыявленныеДефекты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cf/src/Enums/торо_СтатусыУтвержденияЗаказовНаВП/торо_СтатусыУтвержденияЗаказовНаВП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_СтатусыУтвержденияЗаказовНаВП</name>
  <enumValues>
    <name>проф_Новый</name>
  </enumValues>
  <enumValues>
    <name>НаУтверждении</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>УтвержденЧастично</name>
  </enumValues>
  <enumValues>
    <name>ВозвращенНаДоработку</name>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
  </enumValues>
</mdclass:Enum>

src/toir_cf/src/Enums/торо_СтатусыУтвержденияСтрокЗаказовНаВП/торо_СтатусыУтвержденияСтрокЗаказовНаВП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_СтатусыУтвержденияСтрокЗаказовНаВП</name>
  <enumValues>
    <name>НаУтверждении</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>Отменено</name>
  </enumValues>
  <enumValues>
    <name>ЕстьЗамечания</name>
  </enumValues>
  <enumValues>
    <name>ЗамечанияИсправлены</name>
  </enumValues>
</mdclass:Enum>

src/toir_cf/src/Documents/ЗаказНаВнутреннееПотребление/ЗаказНаВнутреннееПотребление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказНаВнутреннееПотребление</name>
  <registerRecords>InformationRegister.проф_ЗаменаНаАналоги</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыНаВнутреннееПотребление</registerRecords>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.торо_ПланГрафикРемонта</types>
      <types>DocumentRef.торо_ГрафикРегламентныхМероприятийТОиР</types>
      <types>DocumentRef.ЗаказНаВнутреннееПотребление</types>
      <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйКодСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_СозданПоПотребности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_IDРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>торо_ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ТехКарта</name>
    <type>
      <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_СтатусУтверждения</name>
    <type>
      <types>EnumRef.торо_СтатусыУтвержденияЗаказовНаВП</types>
    </type>
  </attributes>
  <attributes>
    <name>проф_НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.проф_НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>проф_Назначение</name>
    <type>
      <types>CatalogRef.проф_Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>проф_ЗаказДляЗакупки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>проф_ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.проф_ХозяйственнаяОперация</types>
    </type>
  </attributes>
  <attributes>
    <name>проф_ДатаУтверждения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>проф_КЗВП</name>
    <type>
      <types>EnumRef.проф_КЗВПДО</types>
    </type>
  </attributes>
  <attributes>
    <name>проф_ТипЗаказа</name>
    <type>
      <types>EnumRef.проф_ТипЗаказа</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>торо_СтатусУтверждения</name>
      <type>
        <types>EnumRef.торо_СтатусыУтвержденияСтрокЗаказовНаВП</types>
      </type>
    </attributes>
    <attributes>
      <name>проф_КатегорииЭксплуатации</name>
      <type>
        <types>CatalogRef.проф_КатегорииЭксплуатации</types>
      </type>
    </attributes>
    <attributes>
      <name>проф_ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>проф_ПризнакЗапчасти</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>проф_КЗаказу</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>проф_ПричинаОтмены</name>
      <type>
        <types>DocumentRef.торо_АктОВыполненииЭтапаРабот</types>
        <types>CatalogRef.проф_ПричиныОтмены</types>
      </type>
    </attributes>
    <attributes>
      <name>проф_Отменил</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>торо_ЗамененныеАналогамиМатериалы</name>
    <attributes>
      <name>КодСтрокиАналога</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодСтрокиНоменклатуры</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>проф_ТоварыИсточника</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РемонтыОборудования_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cf/src/DataProcessors/торо_РабочееМестоУтвержденияЗаказовНаВнутреннееПотребление/Forms/ФормаЗаказовДляЗаполненияСтатусов/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если КоличествоДокументовКЗаполнению() = 0 Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	СписокЗаказов.Параметры.УстановитьЗначениеПараметра("ДатаНачалаДня", НачалоДня(ТекущаяДата()));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если ЗаполнитьНаСервере() Тогда
		ПараметрЗакрытия = Новый Структура("Результат", "Успешно");
	Иначе
		ПараметрЗакрытия = Новый Структура("Результат", "Ошибка");
	КонецЕсли;
	
	Закрыть(ПараметрЗакрытия);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокЗаказовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СписокЗаказов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(, ТекущиеДанные.Документ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция КоличествоДокументовКЗаполнению()
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(ЗаказНаВнутреннееПотреблениеТоваров.Ссылка) КАК Количество
	               |ИЗ
	               |	Документ.ЗаказНаВнутреннееПотребление КАК ЗаказНаВнутреннееПотреблениеТоваров
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОбщиеДанныеПоРемонтам КАК торо_ОбщиеДанныеПоРемонтам
	               |		ПО ЗаказНаВнутреннееПотреблениеТоваров.торо_IDРемонта = торо_ОбщиеДанныеПоРемонтам.IDРемонта
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВнутреннееПотреблениеТоваров КАК ВнутреннееПотреблениеТоваров
	               |		ПО ЗаказНаВнутреннееПотреблениеТоваров.Ссылка = ВнутреннееПотреблениеТоваров.ЗаказНаВнутреннееПотребление
	               |ГДЕ
	               |	НЕ ЗаказНаВнутреннееПотреблениеТоваров.ПометкаУдаления
	               |	И ЗаказНаВнутреннееПотреблениеТоваров.ДатаОтгрузки >= &ДатаНачалаДня
	               |	И ЗаказНаВнутреннееПотреблениеТоваров.торо_СтатусУтверждения = ЗНАЧЕНИЕ(Перечисление.торо_СтатусыУтвержденияЗаказовНаВП.ПустаяСсылка)
	               |	И (торо_ОбщиеДанныеПоРемонтам.IDРемонта ЕСТЬ NULL
	               |			ИЛИ НЕ торо_ОбщиеДанныеПоРемонтам.Завершен)
	               |	И (ВнутреннееПотреблениеТоваров.ЗаказНаВнутреннееПотребление ЕСТЬ NULL
	               |			ИЛИ ВнутреннееПотреблениеТоваров.ПометкаУдаления
	               |			ИЛИ НЕ ВнутреннееПотреблениеТоваров.Проведен)";
	
	Запрос.УстановитьПараметр("ДатаНачалаДня", НачалоДня(ТекущаяДата()));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
	    Возврат 0;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Количество;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказНаВнутреннееПотреблениеТоваров.Ссылка КАК Документ
	               |ИЗ
	               |	Документ.ЗаказНаВнутреннееПотребление КАК ЗаказНаВнутреннееПотреблениеТоваров
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОбщиеДанныеПоРемонтам КАК торо_ОбщиеДанныеПоРемонтам
	               |		ПО ЗаказНаВнутреннееПотреблениеТоваров.торо_IDРемонта = торо_ОбщиеДанныеПоРемонтам.IDРемонта
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВнутреннееПотреблениеТоваров КАК ВнутреннееПотреблениеТоваров
	               |		ПО ЗаказНаВнутреннееПотреблениеТоваров.Ссылка = ВнутреннееПотреблениеТоваров.ЗаказНаВнутреннееПотребление
	               |ГДЕ
	               |	НЕ ЗаказНаВнутреннееПотреблениеТоваров.ПометкаУдаления
	               |	И ЗаказНаВнутреннееПотреблениеТоваров.ДатаОтгрузки >= &ДатаНачалаДня
	               |	И ЗаказНаВнутреннееПотреблениеТоваров.торо_СтатусУтверждения = ЗНАЧЕНИЕ(Перечисление.торо_СтатусыУтвержденияЗаказовНаВП.ПустаяСсылка)
	               |	И (торо_ОбщиеДанныеПоРемонтам.IDРемонта ЕСТЬ NULL
	               |			ИЛИ НЕ торо_ОбщиеДанныеПоРемонтам.Завершен)
	               |	И (ВнутреннееПотреблениеТоваров.ЗаказНаВнутреннееПотребление ЕСТЬ NULL
	               |			ИЛИ ВнутреннееПотреблениеТоваров.ПометкаУдаления
	               |			ИЛИ НЕ ВнутреннееПотреблениеТоваров.Проведен)";
	
	Запрос.УстановитьПараметр("ДатаНачалаДня", НачалоДня(ТекущаяДата()));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
	    Возврат Истина;
	КонецЕсли;

	Попытка
		ВыборкаДокументов = РезультатЗапроса.Выбрать();
		Пока ВыборкаДокументов.Следующий() Цикл
		    ДокументОбъект = ВыборкаДокументов.Документ.ПолучитьОбъект();
			
			ВсеСтрокиОтменены = Истина;
			
			Для каждого СтрокаТЧ Из ДокументОбъект.Товары Цикл
			    Если СтрокаТЧ.Отменено Тогда
				    СтрокаТЧ.торо_СтатусУтверждения = Перечисления.торо_СтатусыУтвержденияСтрокЗаказовНаВП.Отменено;
				Иначе
					СтрокаТЧ.торо_СтатусУтверждения = Перечисления.торо_СтатусыУтвержденияСтрокЗаказовНаВП.НаУтверждении;
					ВсеСтрокиОтменены = Ложь;
				КонецЕсли;
			КонецЦикла;
			
			Если ВсеСтрокиОтменены Тогда
				ДокументОбъект.торо_СтатусУтверждения = Перечисления.торо_СтатусыУтвержденияЗаказовНаВП.Отклонен;
			Иначе
				ДокументОбъект.торо_СтатусУтверждения = Перечисления.торо_СтатусыУтвержденияЗаказовНаВП.НаУтверждении;
			КонецЕсли;
			
			ДокументОбъект.Записать();
		КонецЦикла;
	Исключение
		ШаблонСообщения = НСтр("ru = 'При заполнении реквизита ""Статус утверждения"" документа %1 произошла ошибка по причине: %2'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ВыборкаДокументов.Документ, ОписаниеОшибки());
		
		ЗаписьЖурналаРегистрации("Заполнение статуса утверждения заказа на внутреннее потребление", УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.ЗаказНаВнутреннееПотребление,, ТекстСообщения);
		
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти
